refactoring_gecoding.org
#+SETUPFILE: ~/Dropbox/org-minimal-html-theme/org-minimal-theme.setup
#+HTML_HEAD: <style type="text/css">.example {background-color: #eff0f1; color: #ff0000;}</style>
#+TITLE: Refactoring  Python Google Maps Access Code

So, I've been working on analysis of property prices in Ireland recently [fn:1],
and I sourced some code from Shane Lynn, who did this before [fn:2]. 

Unfortunately, he stopped doing this in 2016 (back when Google Maps was still free). 

So, as part of my work, I ran this script up till October 2018 to update
to the (then) most recent date. 

However, that was a long time ago now, and I actually want to make this easier
for myself in the future by automating it.

Unfortunately, it's just a script that doesn't take arguments and doesn't really
lend itself well to extension. While I don't think I'll need to change
it too much in the future, I would like to be able to update the database
at the flick of a button so I can build tools on top of the database. 

Additionally, there's a commercial leases register that I'd like to
give the same treatment. In order to do this, I'm going to take
the advice of the esteemed Kent Beck: 
#+BEGIN_QUOTE
First make the change easy (warning: this may be hard!); then make the easy change
#+END_QUOTE

In general, this article talks about refactoring in the Martin Fowler sense:
#+BEGIN_QUOTE
code refactoring is the process of restructuring existing computer
code — changing the factoring — without changing its external behavior
#+END_QUOTE

So, this imposes some constraints on us. We *must not* modify the behaviour
while improving the structure. In order to make this work, we need some
tests to assess what the current behaviour is.

Unfortunately, we don't have any tests for this script, except for
the already existing tests (the old data). Additionally, each network
call we make costs money so we want to improve this script without
costing ourselves too much money [fn:3]

I'm going to approach this in a reasonably structured way. Firstly,
we'll review each piece of the script, and assess what would
make it more maintainable, or at least more maintainable. 

I'll reference particular refactorings from the book of the same
name [fn:4]. These have a number associated with them, which
is the page number from the 2nd edition. 

