refactoring_gecoding.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-01-01 Fri 12:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Refactoring  Python Google Maps Access Code</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">Refactoring  Python Google Maps Access Code</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3757244">0.1. Introduction &amp; Imports</a></li>
<li><a href="#org7bacc70">0.2. Generating Test Data</a></li>
<li><a href="#org3ba9d0f">0.3. Functional Testing</a></li>
<li><a href="#orgae05a65">0.4. Functional Testing in R</a></li>
<li><a href="#org58b3cd9">0.5. Back to Options</a></li>
<li><a href="#org3f1099e">0.6. More Unit Tests</a></li>
<li><a href="#orgbfc29db">0.7. Reviewing where we are</a></li>
</ul>
</li>
<li><a href="#org76a0e9e">1. Conclusions</a></div>
</div>
<p>
So, I've been working on analysis of property prices in Ireland recently <sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>,
and I sourced some code from Shane Lynn, who did this before <sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>. 
</p>

<p>
Unfortunately, he stopped doing this in 2016 (back when Google Maps was still free). 
</p>

<p>
So, as part of my work, I ran this script up till October 2018 to update
to the (then) most recent date. 
</p>

<p>
However, that was a long time ago now, and I actually want to make this easier
for myself in the future by automating it.
</p>

<p>
Unfortunately, it's just a script that doesn't take arguments and doesn't really
lend itself well to extension. While I don't think I'll need to change
it too much in the future, I would like to be able to update the database
at the flick of a button so I can build tools on top of the database. 
</p>

<p>
Additionally, there's a commercial leases register that I'd like to
give the same treatment. In order to do this, I'm going to take
the advice of the esteemed Kent Beck: 
</p>
<blockquote>
<p>
First make the change easy (warning: this may be hard!); then make the easy change
</p>
</blockquote>

<p>
In general, this article talks about refactoring in the Martin Fowler sense:
</p>
<blockquote>
<p>
code refactoring is the process of restructuring existing computer
code — changing the factoring — without changing its external behavior
</p>
</blockquote>

<p>
So, this imposes some constraints on us. We <b>must not</b> modify the behaviour
while improving the structure. In order to make this work, we need some
tests to assess what the current behaviour is.
</p>

<p>
Unfortunately, we don't have any tests for this script, except for
the already existing tests (the old data). Additionally, each network
call we make costs money so we want to improve this script without
costing ourselves too much money <sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup>
</p>

<p>
I'm going to approach this in a reasonably structured way. Firstly,
we'll review each piece of the script, and assess what would
make it more maintainable, or at least more maintainable. 
</p>

<p>
I'll reference particular refactorings from the book of the same
name <sup><a id="fnr.4" class="footref" href="#fn.4">4</a></sup>. 
</p>
