refactoring_gecoding.org
** Introduction & Imports

#+BEGIN_SRC python 
  """Python script for batch geocoding of addresses using the Google
  Geocoding API.  This script allows for massive lists of addresses to
  be geocoded for free by pausing when the geocoder hits the free rate
  limit set by Google (2500 per day).  If you have an API key for paid
  geocoding from Google, set it in the API key section.  Addresses for
  geocoding can be specified in a list of strings "addresses". In this
  script, addresses come from a csv file with a column "Address". Adjust
  the code to your own requirements as needed.  After every 500
  successul geocode operations, a temporary file with results is
  recorded in case of script failure / loss of connection later.
  Addresses and data are held in memory, so this script may need to be
  adjusted to process files line by line if you are processing millions
  of entries.  Shane Lynn 5th November 2016 """

  import pandas as pd
  import requests

  import time
#+END_SRC

This is pretty unremarkable, except that the comments are now lies. 

We should probably change this, but commenting the overall 
script is a task best done at the end of this process, to 
avoid it becoming misleading (as in this case). 

Current step: delete comments. 

#+BEGIN_SRC python 
 logger = logging.getLogger("root")
 logger.setLevel(logging.DEBUG)
 # create console handler
 ch = logging.StreamHandler()
 ch.setLevel(logging.DEBUG)
 logger.addHandler(ch)
#+END_SRC

The next portion of the code sets up a logger. 

This doesn't really need to be at the top level, so we
can abstract it into a function. Essentially, we're
doing the extract function refactoring here.

This is a nice easy one, as the logger isn't
mutated or used in multiple places further on. 

#+BEGIN_SRC python :tangle geocode/geocode_funcs.py
  import logging
  import requests
  import pandas as pd
  def create_logger():
      logger = logging.getLogger("root")
      logger.setLevel(logging.DEBUG)
      # create console handler
      ch = logging.StreamHandler()
      ch.setLevel(logging.DEBUG)
      logger.addHandler(ch)
      return logger


#+END_SRC

We could update this to handle different log levels,
but that's a bigger change so we'll avoid doing it for now. 

Given that we have a function, we can actually write 
a test. In general, it's better to write these tests
before the code (i.e. Test-Driven-Development), but
when working with legacy code (even small pieces of it like this),
this tends to be less practical. 

Before we can write and run tests easily, we need to create a directory
to hold our code and tests. We also need to invoke the ghost of python
actions, __init__.py. 

#+BEGIN_SRC sh
mkdir geocode
mkdir geocode/tests/
touch geocode/tests/__init__.py
#+END_SRC

#+RESULTS:


Now we can add a test file, and start moving code from the top level file
into the package, adding tests as we go. 

#+BEGIN_SRC python :tangle geocode/tests/test_google.py
import pytest
from geocode_funcs import create_logger, get_api_key
#+END_SRC

#+BEGIN_SRC python :tangle geocode/tests/test_google.py

  def test_logger_is_created() -> None:
      logger = create_logger()
      assert logger is not None


#+END_SRC

This is a crappy test, but we'll improve it as we go. The important
thing is to start adding tests, as they make it easier to iterate. 

#+BEGIN_SRC python
 key_file = open("key.txt", "r")
 key = key_file.readline().strip()
 API_KEY = key
#+END_SRC

The next part of the code deals with authentication.
We don't want to put keys in the scripts, as that's a big security
risk. 

We should create a function here, which takes a path and returns a string
with the key. First we'll write another test, so that we know
what we're doing. 

#+BEGIN_SRC python :tangle geocode/tests/test_google.py
  def test_get_api_key() -> None:
      path = 'key.txt'
      apikey = get_api_key(path)
      assert isinstance(apikey, str)
#+END_SRC



We run this test, and it fails because the function doesn't exist.
Let's add it now. 


#+BEGIN_SRC python :tangle geocode/geocode_funcs.py
  def get_api_key(path) -> str:
      key_file = open(path, "r")
      key = key_file.readline().strip()
      return key


#+END_SRC


Again, this is just mostly mechanical. 

The only real art to it is deciding what to break down, and what to
name stuff. In general, making changes like this is dangerous,
so you want to take a bunch of small steps and add tests, to 
avoid causing more problems than you solve. 



The next portion of the code handles options

#+BEGIN_SRC python
BACKOFF_TIME = 30
 # Set your output file name here.
 output_filename = 'output_full_2018_19.csv'
 # Set your input file here
 input_filename = 'prop2018-19_todo.csv'
 # Specify the column name in your input data that contains addresses here
 address_column_name = "address"
 # Return Full Google Results? If True, full JSON results from Google are included in output
 RETURN_FULL_RESULTS = True
#+END_SRC

In general, these should probably be arguments (using argparse).

Normally, I wouldn't make this change now, but as you may or may not
recall, we actually haven't run the whole process end-to-end
yet. [fn:5]. In order to make testing easy, we need to add these
options now (so that we can easily pass in test data). 

We'll use [[https://docs.python.org/3/howto/argparse.html][argparse]], which is included in the python standard library. 

Argpase essentially uses a Parser object, to which one
adds arguments which can then be used on the command line. 

It's essentially a nicer version of $1, $2 etc. 

One thing that strikes me now is that I'm not really sure how to test
this kind of code (i.e. argument parsing). Everything that I can
think of seems a little redundant, to be honest. 

For now, we'll rush ahead, but keep the lack of tests around this
part of the code in mind for the future. 


#+BEGIN_SRC python 
import argparse
parser = argparse.ArgumentParser()
args = parser.parse_args()
#+END_SRC


Hmmm, interesting. My approach to this script was to break down the
functionality into a library of functions, and then replace the
inline code with calls to the (tested) functions. 

Clearly this won't work with the argument parser, as it's by definition
embedded within the top-level script. So we're actually gonna
need to back up here, and get some (small) test data with known answers
(i.e. already parsed) so that we can ensure we don't break anything
when we change this. [fn:6]. 

