refactoring_gecoding.html

<div id="outline-container-org3757244" class="outline-3">
<h3 id="org3757244"><span class="section-number-3">0.1</span> Introduction &amp; Imports</h3>
<div class="outline-text-3" id="text-0-1">
<div class="org-src-container">
<pre class="src src-python">"""Python script for batch geocoding of addresses using the Google
Geocoding API.  This script allows for massive lists of addresses to
be geocoded for free by pausing when the geocoder hits the free rate
limit set by Google (2500 per day).  If you have an API key for paid
geocoding from Google, set it in the API key section.  Addresses for
geocoding can be specified in a list of strings "addresses". In this
script, addresses come from a csv file with a column "Address". Adjust
the code to your own requirements as needed.  After every 500
successul geocode operations, a temporary file with results is
recorded in case of script failure / loss of connection later.
Addresses and data are held in memory, so this script may need to be
adjusted to process files line by line if you are processing millions
of entries.  Shane Lynn 5th November 2016 """

import pandas as pd
import requests

import time
</pre>
</div>

<p>
This is pretty unremarkable, except that the comments are now lies. 
</p>

<p>
We should probably change this, but commenting the overall 
script is a task best done at the end of this process, to 
avoid it becoming misleading (as in this case). 
</p>

<p>
Current step: delete comments. 
</p>

<div class="org-src-container">
<pre class="src src-python">logger = logging.getLogger("root")
logger.setLevel(logging.DEBUG)
# create console handler
ch = logging.StreamHandler()
ch.setLevel(logging.DEBUG)
logger.addHandler(ch)
</pre>
</div>

<p>
The next portion of the code sets up a logger. 
</p>

<p>
This doesn't really need to be at the top level, so we
can abstract it into a function. Essentially, we're
doing the extract function refactoring here.
</p>

<p>
This is a nice easy one, as the logger isn't
mutated or used in multiple places further on. 
</p>

<div class="org-src-container">
<pre class="src src-python">import logging
import requests
import pandas as pd
def create_logger():
    logger = logging.getLogger("root")
    logger.setLevel(logging.DEBUG)
    # create console handler
    ch = logging.StreamHandler()
    ch.setLevel(logging.DEBUG)
    logger.addHandler(ch)
    return logger


</pre>
</div>

<p>
We could update this to handle different log levels,
but that's a bigger change so we'll avoid doing it for now. 
</p>

<p>
Given that we have a function, we can actually write 
a test. In general, it's better to write these tests
before the code (i.e. Test-Driven-Development), but
when working with legacy code (even small pieces of it like this),
this tends to be less practical. 
</p>

<p>
Before we can write and run tests easily, we need to create a directory
to hold our code and tests. We also need to invoke the ghost of python
actions, <span class="underline"><span class="underline">init</span></span>.py. 
</p>

<div class="org-src-container">
<pre class="src src-sh">mkdir geocode
mkdir geocode/tests/
touch geocode/tests/__init__.py
</pre>
</div>


<p>
Now we can add a test file, and start moving code from the top level file
into the package, adding tests as we go. 
</p>

<div class="org-src-container">
<pre class="src src-python">import pytest
from geocode_funcs import create_logger, get_api_key
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python">
def test_logger_is_created() -&gt; None:
    logger = create_logger()
    assert logger is not None


</pre>
</div>

<p>
This is a crappy test, but we'll improve it as we go. The important
thing is to start adding tests, as they make it easier to iterate. 
</p>

<div class="org-src-container">
<pre class="src src-python">key_file = open("key.txt", "r")
key = key_file.readline().strip()
API_KEY = key
</pre>
</div>

<p>
The next part of the code deals with authentication.
We don't want to put keys in the scripts, as that's a big security
risk. 
</p>

<p>
We should create a function here, which takes a path and returns a string
with the key. First we'll write another test, so that we know
what we're doing. 
</p>

<div class="org-src-container">
<pre class="src src-python">def test_get_api_key() -&gt; None:
    path = 'key.txt'
    apikey = get_api_key(path)
    assert isinstance(apikey, str)
</pre>
</div>



<p>
We run this test, and it fails because the function doesn't exist.
Let's add it now. 
</p>


<div class="org-src-container">
<pre class="src src-python">def get_api_key(path) -&gt; str:
    key_file = open(path, "r")
    key = key_file.readline().strip()
    return key


</pre>
</div>


<p>
Again, this is just mostly mechanical. 
</p>

<p>
The only real art to it is deciding what to break down, and what to
name stuff. In general, making changes like this is dangerous, so you
want to take a bunch of small steps and add tests, to avoid causing
more problems than you solve.
</p>



<p>
The next portion of the code handles options
</p>

<div class="org-src-container">
<pre class="src src-python">BACKOFF_TIME = 30
 # Set your output file name here.
 output_filename = 'output_full_2018_19.csv'
 # Set your input file here
 input_filename = 'prop2018-19_todo.csv'
 # Specify the column name in your input data that contains addresses here
 address_column_name = "address"
 # Return Full Google Results? If True, full JSON results from Google are included in output
 RETURN_FULL_RESULTS = True
</pre>
</div>

<p>
In general, these should probably be arguments (using argparse).
</p>

<p>
Normally, I wouldn't make this change now, but as you may or may not
recall, we actually haven't run the whole process end-to-end
yet. <sup><a id="fnr.5" class="footref" href="#fn.5">5</a></sup>. In order to make testing easy, we need to add these
options now (so that we can easily pass in test data). 
</p>

<p>
We'll use <a href="https://docs.python.org/3/howto/argparse.html">argparse</a>, which is included in the python standard library. 
</p>

<p>
Argpase essentially uses a Parser object, to which one
adds arguments which can then be used on the command line. 
</p>

<p>
It's essentially a nicer version of $1, $2 etc. 
</p>

<p>
One thing that strikes me now is that I'm not really sure how to test
this kind of code (i.e. argument parsing). Everything that I can
think of seems a little redundant, to be honest. 
</p>

<p>
For now, we'll rush ahead, but keep the lack of tests around this
part of the code in mind for the future. 
</p>


<div class="org-src-container">
<pre class="src src-python">import argparse
parser = argparse.ArgumentParser()
args = parser.parse_args()
</pre>
</div>


<p>
Hmmm, interesting. My approach to this script was to break down the
functionality into a library of functions, and then replace the
inline code with calls to the (tested) functions. 
</p>

<p>
Clearly this won't work with the argument parser, as it's by definition
embedded within the top-level script. So we're actually gonna
need to back up here, and get some (small) test data with known answers
(i.e. already parsed) so that we can ensure we don't break anything
when we change this. <sup><a id="fnr.6" class="footref" href="#fn.6">6</a></sup>. 
</p>
</div>
</div>
