refactoring_gecoding.org
** Generating Test Data

The best test data is actual data that you already log. 
In many cases, this may be the only thing that you can reliably get your hands on.

In this particular situation, things aren't so bad. The results we
get are determined only by the input file and one file of code 
which isn't too tangled. In some other systems, even getting your
hands on test data represents an awful lot of work. 

So, let's examine our input and output data.

The original script has the following bunch of options. 

#+BEGIN_SRC python :exports code
 # Set your output file name here.
 output_filename = 'output_full_2018_19.csv'
 # Set your input file here
 input_filename = 'prop2018-19_todo.csv'
#+END_SRC

So, we take in data from the input filename, and put it out to
output_filename [fn:7].

When we look at the input file name, we see the following. 

#+BEGIN_SRC sh :exports results
wc -l prop2018-19_todo.csv
#+END_SRC

#+RESULTS:
: 37188 prop2018-19_todo.csv

OK, so we have 37k input rows. This would be the perfect test case,
but it's impractical as it would take a /loooooonnng/ time to generate,
and would cost me more money than I'm prepared to spend for a test run. 

We'll subset the data to just take five lines right now, to give us 
a small functional test we can run to make sure that we're not
breaking the application in the course of refactoring. 

#+BEGIN_SRC sh 
head -5 prop2018-19_todo.csv > input_sample_data.csv
#+END_SRC

#+RESULTS:


#+BEGIN_SRC sh :exports results
head input_sample_data.csv
#+END_SRC

#+RESULTS:
| date_of_sale_dd_mm_yyyy | address                               | postal_code | county    |    price | not_full_market_price | vat_exclusive | description_of_property               | property_size_description |
| 09/11/2018              | KNOCKEIL, RATHDOWNEY, CO. LAOIS       | NA          | Laois     |  4500000 | No                    | No            | Second-Hand Dwelling house /Apartment | NA                        |
| 09/11/2018              | KNOCKGRAFFON, CHAIR, CO TIPPERARY     | NA          | Tipperary | 20000000 | No                    | No            | Second-Hand Dwelling house /Apartment | NA                        |
| 09/11/2018              | KNOCKNABINNY, BARRELLS CROSS, KINSALE | NA          | Cork      | 64000000 | No                    | No            | Second-Hand Dwelling house /Apartment | NA                        |
| 09/11/2018              | KNOCKNORAN, KILMORE, WEXFORD          | NA          | Wexford   | 20000000 | No                    | No            | Second-Hand Dwelling house /Apartment | NA                        |


So we can see that this these are rows from the PPR. We don't really need most of this data,
but it's easier to just keep it (according to our principle of minimising changes). 

Next, let's look at the output data. 

#+BEGIN_SRC sh :exports results
wc -l output_full_2018_19.csv
#+END_SRC

#+RESULTS:
: 10001 output_full_2018_19.csv

Oddly, we have less output rows. I /think/ that's because I ran this
three times as it kept breaking, but I don't appear to have any 
notes to remind myself of this fact [fn:8]. 

Hopefully, the first output rows match our first input rows. 

#+BEGIN_SRC sh
awk -F, '{print $2, $5}' output_full_2018_19.csv
#+END_SRC

And here, children is where I remember that I hate awk when dealing
with formatted CSVs. The problem always ends up being commas in input
data. This is particularly common in addresses, which is what
we're dealing with here. Ah well, fortunately there are other tools. 

My normal response to this kind of thing would be R, but given that
we're using python here I guess I'll have to content myself with
pandas. 

#+BEGIN_SRC python :session
  import pandas as pd
  output_data = pd.read_csv("output_full_2018_19.csv")
  input_data = pd.read_csv("input_sample_data.csv")
  output_data.keys()
#+END_SRC

#+RESULTS:
: Index(['Unnamed: 0', 'accuracy', 'formatted_address', 'google_place_id',
:        'input_string', 'latitude', 'longitude', 'number_of_results',
:        'postcode', 'response', 'status', 'type'],
:       dtype='object')

So, we want formatted address and input string, for now. 

#+BEGIN_SRC python :session
  address_input_output = output_data[["input_string", "formatted_address"]]
  address_input_output.head()
#+END_SRC

#+RESULTS:
:                                         input_string                              formatted_address
: 0      KNOCKEIL, RATHDOWNEY, CO. LAOIS,Laois,Ireland    Knockiel Dr, Rathdowney, Co. Laois, Ireland
: 1  KNOCKGRAFFON, CHAIR, CO TIPPERARY,Tipperary,Ir...  Knockgraffon, New Inn, Co. Tipperary, Ireland
: 2  KNOCKNABINNY, BARRELLS CROSS, KINSALE,Cork,Ire...                Knocknabinny, Co. Cork, Ireland
: 3       KNOCKNORAN, KILMORE, WEXFORD,Wexford,Ireland               Knocknoran, Co. Wexford, Ireland
: 4               LACKA, SHINRONE, BIRR,Offaly,Ireland                  Lacka, Co. Tipperary, Ireland

** Functional Testing

OK, this looks good, in that we have the same addresses as in the input data.
This means that we actually have a base set of data to compare our results
to, which is critically important if we're going to avoid breakages. 

However, we don't want to be comparing strings to one another in our
tests, as that's tedious and error-prone. The question of what to test
is one that deserves more attention than it gets. Many of us seem to
either be test nothing or test everything, whereas most of the interesting
questions are around how can we get the maximum impact from minimum
tests. 



Normally what I'd do here is use some kind of dataframe equality
method on the outputs. We save our original output under a particular
name (I'm a fan of output_old, myself) and then we rerun the process
that generates the script. 

Pandas has a df.equals method, so hopefully this will _just work_. 

We need to run the original script on the sample addresses, to
create an up to date record of what the results were.

Following this, each time we make a significant change we can run
this functional test and make sure that nothing has broken. 

#+BEGIN_SRC sh
python geocode_original.py 
#+END_SRC

This runs the Gmaps API on the four input addresses and returns the data.
Note that I needed to alter the original script to have the same data. 



#+BEGIN_SRC python :session
  output_old = pd.read_csv('output_sample_data.csv')
  output_check = output_data.iloc[0:4,]
  output_check = output_data.iloc[0:4,]
  output_check.equals(output_old)

#+END_SRC

#+RESULTS:
: False

So, it doesn't work; but it doesn't tell us why it doesn't work
(unlike *all.equal* in R).That's irritating, but data science and
technology in general tends to be a world of irritations so we'll
move on and check. 

One good comparison would be the lat-long variables returned from Geocoding.
We wouldn't expect these to change over time (unless Google start identifying
addresses better at some point), and they are numeric and thus less error-prone
to compare (after accounting for the vagaries of float and rounding methods). 

#+BEGIN_SRC python :session
  latlong_check = output_check[["latitude", "longitude"]]
  latlong_old = output_old[["latitude", "longitude"]]
  latlong_check.equals(latlong_old)
#+END_SRC

#+RESULTS:
: False

Still false. Odd, let's look at the data to see what's going on here. 

#+BEGIN_SRC python :session
latlong_check.head()
#+END_SRC

#+RESULTS:
:     latitude  longitude
: 0  52.851635  -7.589150
: 1  52.422151  -7.924781
: 2  51.687483  -8.572435
: 3  52.210920  -6.564558

#+BEGIN_SRC python :session
latlong_old.head()
#+END_SRC

#+RESULTS:
:     latitude  longitude
: 0  52.851635  -7.589150
: 1  52.422151  -7.924781
: 2  51.687563  -8.564443
: 3  52.210920  -6.564558


So, this is a complete waste of time, lets take a different approach. 

