refactoring_gecoding.html

<div id="outline-container-org7bacc70" class="outline-3">
<h3 id="org7bacc70"><span class="section-number-3">0.2</span> Generating Test Data</h3>
<div class="outline-text-3" id="text-0-2">
<p>
The best test data is actual data that you already log. 
In many cases, this may be the only thing that you can reliably get your hands on.
</p>

<p>
In this particular situation, things aren't so bad. The results we
get are determined only by the input file and one file of code 
which isn't too tangled. In some other systems, even getting your
hands on test data represents an awful lot of work. 
</p>

<p>
So, let's examine our input and output data.
</p>

<p>
The original script has the following bunch of options. 
</p>

<div class="org-src-container">
<pre class="src src-python"># Set your output file name here.
output_filename = 'output_full_2018_19.csv'
# Set your input file here
input_filename = 'prop2018-19_todo.csv'
</pre>
</div>

<p>
So, we take in data from the input filename, and put it out to
output<sub>filename</sub> <sup><a id="fnr.7" class="footref" href="#fn.7">7</a></sup>.
</p>

<p>
When we look at the input file name, we see the following. 
</p>

<p>
OK, so we have 37k input rows. This would be the perfect test case,
but it's impractical as it would take a <i>loooooonnng</i> time to generate,
and would cost me more money than I'm prepared to spend for a test run. 
</p>

<p>
We'll subset the data to just take five lines right now, to give us 
a small functional test we can run to make sure that we're not
breaking the application in the course of refactoring. 
</p>

<div class="org-src-container">
<pre class="src src-sh">head -5 prop2018-19_todo.csv &gt; input_sample_data.csv
</pre>
</div>


<p>
So we can see that this these are rows from the PPR. We don't really need most of this data,
but it's easier to just keep it (according to our principle of minimising changes). 
</p>

<p>
Next, let's look at the output data. 
</p>

<pre class="example">
10001 output_full_2018_19.csv
</pre>


<p>
Oddly, we have less output rows. I <i>think</i> that's because I ran this
three times as it kept breaking, but I don't appear to have any 
notes to remind myself of this fact <sup><a id="fnr.8" class="footref" href="#fn.8">8</a></sup>. 
</p>

<p>
Hopefully, the first output rows match our first input rows. 
</p>

<div class="org-src-container">
<pre class="src src-sh">awk -F, '{print $2, $5}' output_full_2018_19.csv
</pre>
</div>

<p>
And here, children is where I remember that I hate awk when dealing
with formatted CSVs. The problem always ends up being commas in input
data. This is particularly common in addresses, which is what
we're dealing with here. Ah well, fortunately there are other tools. 
</p>

<p>
My normal response to this kind of thing would be R, but given that
we're using python here I guess I'll have to content myself with
pandas. 
</p>

<div class="org-src-container">
<pre class="src src-python">import pandas as pd
output_data = pd.read_csv("output_full_2018_19.csv")
input_data = pd.read_csv("input_sample_data.csv")
output_data.keys()
</pre>
</div>

<p>
So, we want formatted address and input string, for now. 
</p>

<div class="org-src-container">
<pre class="src src-python">address_input_output = output_data[["input_string", "formatted_address"]]
address_input_output.head()
</pre>
</div>
</div>
</div>

<div id="outline-container-org3ba9d0f" class="outline-3">
<h3 id="org3ba9d0f"><span class="section-number-3">0.3</span> Functional Testing</h3>
<div class="outline-text-3" id="text-0-3">
<p>
OK, this looks good, in that we have the same addresses as in the input data.
This means that we actually have a base set of data to compare our results
to, which is critically important if we're going to avoid breakages. 
</p>

<p>
However, we don't want to be comparing strings to one another in our
tests, as that's tedious and error-prone. The question of what to test
is one that deserves more attention than it gets. Many of us seem to
either be test nothing or test everything, whereas most of the interesting
questions are around how can we get the maximum impact from minimum
tests. 
</p>



<p>
Normally what I'd do here is use some kind of dataframe equality
method on the outputs. We save our original output under a particular
name and then we rerun the process that generates the script.
</p>

<p>
Pandas has a df.equals method, so hopefully this will <span class="underline">just work</span>. 
</p>

<p>
We need to run the original script on the sample addresses, to
create an up to date record of what the results were.
</p>

<p>
Following this, each time we make a significant change we can run
this functional test and make sure that nothing has broken. 
</p>

<div class="org-src-container">
<pre class="src src-sh">python geocode_original.py 
</pre>
</div>

<p>
This runs the Gmaps API on the four input addresses and returns the data.
Note that I needed to alter the original script to have the same data. 
</p>



<div class="org-src-container">
<pre class="src src-python">output_old = pd.read_csv('output_sample_data.csv')
output_check = output_data.iloc[0:4,]
output_check = output_data.iloc[0:4,]
output_check.equals(output_old)

</pre>
</div>

<p>
So, it doesn't work; but it doesn't tell us why it doesn't work
(unlike <b>all.equal</b> in R).That's irritating, but data science and
technology in general tends to be a world of irritations so we'll
move on and check. 
</p>

<p>
One good comparison would be the lat-long variables returned from Geocoding.
We wouldn't expect these to change over time (unless Google start identifying
addresses better at some point), and they are numeric and thus less error-prone
to compare (after accounting for the vagaries of float and rounding methods). 
</p>

<p>
Still false. Odd, let's look at the data to see what's going on here. 
</p>

<pre class="example">
    latitude  longitude
0  52.851635  -7.589150
1  52.422151  -7.924781
2  51.687483  -8.572435
3  52.210920  -6.564558
</pre>


<p>
So, this is a complete waste of time, lets take a different approach. 
</p>
</div>
</div>
