refactoring_gecoding.html

<div id="outline-container-orgae05a65" class="outline-3">
<h3 id="orgae05a65"><span class="section-number-3">0.4</span> Functional Testing in R</h3>
<div class="outline-text-3" id="text-0-4">
<p>
I can do this in approximately 5 lines of R, so that's what I'm going to do.
I probably now need some kind of orchestration script, but we'll run things
manually for now. 
</p>

<div class="org-src-container">
<pre class="src src-R">require(testthat)
options(warn=-1)
args &lt;- commandArgs(trailingOnly=TRUE)
output_old  &lt;-  suppressMessages(readr::read_csv(args[[1]]))
output_new &lt;- suppressMessages(readr::read_csv(args[[2]]))
print(test_that("sample files are equal", 
                expect_equal(output_old, output_new)))
</pre>
</div>

<p>
Five lines of R later. To be fair, equality is tricky business, so I'm
not surprised its not quite as easy in Python (as it's not as
domain-specific as R). The great thing about R is the all.equal
methods, which make implementing our test a breeze <sup><a id="fnr.9" class="footref" href="#fn.9">9</a></sup>. 
</p>

<p>
This script can be run as follows:
</p>

<div class="org-src-container">
<pre class="src src-sh">Rscript functional_check.R "output_sample_data.csv" "output_sample_data2.csv"
</pre>
</div>

<p>
And will return either TRUE or FALSE. 
</p>
</div>
</div>
<div id="outline-container-org58b3cd9" class="outline-3">
<h3 id="org58b3cd9"><span class="section-number-3">0.5</span> Back to Options</h3>
<div class="outline-text-3" id="text-0-5">
<p>
You may remember that before this digression, we were considering
options. The argparse module was our chosen approach, but
we noted that we'd need to put these at the top level of our script
in order to make them work. Therefore, we need to create new file,
called <b>geocoder<sub>new.py</sub></b>. 
</p>

<p>
Next, we need to add some options. 
</p>

<div class="org-src-container">
<pre class="src src-python">BACKOFF_TIME = 30
 # Set your output file name here.
 output_filename = 'output_full_2018_19.csv'
 # Set your input file here
 input_filename = 'prop2018-19_todo.csv'
 # Specify the column name in your input data that contains addresses here
 address_column_name = "address"
 # Return Full Google Results? If True, full JSON results from Google are included in output
 RETURN_FULL_RESULTS = True
</pre>
</div>

<p>
So we have five options to add. The first, backoff time is kinda irrelevant now
that Google charge you for each request (not each request over a quota). We'll
leave it as part of the script for now, but it's definitely worth removing
once we have more tests in place. We need output and input filenames, definitely,
and the address<sub>column</sub><sub>name</sub> is also important. These are all strings, which
is the default datatype returned by argparse, so that's nice. Finally we
have return<sub>full</sub><sub>results</sub>, which is a boolean. 
</p>

<div class="org-src-container">
<pre class="src src-python">import argparse
parser = argparse.ArgumentParser()
parser.add_argument("--backoff_time", type=int, help="backoff time", default=30)
parser.add_argument("--input_file", type=str, help="input file containing addresses", default=None)
parser.add_argument("--output_file", type=str, help="file to output geocoded results too", default=None)
parser.add_argument("--address_column", type=str, help="column name with addresses", default=None)
parser.add_argument("--return_full_results", type=bool, help="return full results?", default=True)
args = parser.parse_args()
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">python geocoder_new.py
--input_file=input_sample_data_one.csv //
--output_file=output_sample_data_one.csv //
--address_column=address 
</pre>
</div>

<p>
We can run our new script as above. 
</p>

<p>
If you remember, we had one function in the original
script. Let's take a look at it. 
</p>

<div class="org-src-container">
<pre class="src src-python">def get_google_results(address, api_key=None, return_full_response=False):
    """Get geocode results from Google Maps Geocoding API.
    Note, that in the case of multiple google geocode reuslts, 
    this function returns details of the FIRST result.
    @param address: String address as accurate as possible. For
    Example "18 Grafton Street, Dublin, Ireland" 
    @param api_key:
    String API key for Google Maps Platform
    @param
    return_full_response: Boolean to indicate if you'd like to return
    the full response from google. This is useful if you'd like
    additional location details for storage or parsing later.

    """
    # Set up your Geocoding url
    geocode_url = "https://maps.googleapis.com/maps/api/geocode/json?address={}".format(address)
    if api_key is not None:
        geocode_url = geocode_url + "&amp;key={}".format(api_key)

    # Ping google for the reuslts:
    results = requests.get(geocode_url)
    # Results will be in JSON format - convert to dict using requests functionality
    results = results.json()

    # if there's no results or an error, return empty results.
    if len(results['results']) == 0:
        output = {
            "formatted_address" : None,
            "latitude": None,
            "longitude": None,
            "accuracy": None,
            "google_place_id": None,
            "type": None,
            "postcode": None
        }
    else:    
        answer = results['results'][0]
        output = {
            "formatted_address" : answer.get('formatted_address'),
            "latitude": answer.get('geometry').get('location').get('lat'),
            "longitude": answer.get('geometry').get('location').get('lng'),
            "accuracy": answer.get('geometry').get('location_type'),
            "google_place_id": answer.get("place_id"),
            "type": ",".join(answer.get('types')),
            "postcode": ",".join([x['long_name'] for x in answer.get('address_components') 
                                  if 'postal_code' in x.get('types')])
        }

    # Append some other details:    
    output['input_string'] = address
    output['number_of_results'] = len(results['results'])
    output['status'] = results.get('status')
    if return_full_response is True:
        output['response'] = results

    return output
</pre>
</div>

<p>
We move this to our library, and update the script. There's 
a <i>lot</i> of logic here that processes the results, which makes the name
somewhat deceiving, but let's leave that for now <sup><a id="fnr.10" class="footref" href="#fn.10">10</a></sup>. 
</p>



<p>
We next update our new script to import this function into the main script. 
</p>


<p>
We run again, ensure everything is working, and continue.
</p>
</div>
</div>
