refactoring_gecoding.org
** More Unit Tests

At this point, we should add some tests. The *get_google_results* is the core
of this program, and as such we should make sure that we get good coverage
here. 

There's a couple of things that stand out as needing testing:
- The type of response
- The length of the response: note the doc string
- what happens if there is no address
- full response vs non-full response:
  - differences in returned fields
  - differences in names and shape of said fields

We can skip a bunch of this by just assuming that the results are
correct; and testing that. This is normally called characterisation
testing. Note that this is less useful in small examples like this,
but can be incredibly effective in larger systems. 

The basic idea is that you get some data from the system, like
a geocoded address, save it and then run the test by comparing
the original output to the new output. This is hacky, not pretty
and ruthlessly effective (in the short term). Long term, you
want to actually test the designed functionality (i.e. does the system
do what it's supposed to), but when refactoring, an assurance of
no changes is probably just as useful. 

In order to do this, we need to write a function that 
saves our results in some format. We'll use *pickle* for this
purpose, as it's standard and reasonably simple. 

The way python handles files bugs me normally, so we'll
write a wrapper around the with statement dance we need. 

#+begin_src python :tangle geocode/geocode_funcs.py
  import pickle
  def write_results_to_pickle(results, filename):
      with open(filename, 'wb') as f:
          pickle.dump(results, f)

  def read_results_from_pickle(filename):
      with open(filename, 'rb') as f:
          res = pickle.load(f)
      return res
#+end_src

I really only created these functions


#+begin_src python :tangle geocode/tests/test_google.py
  from geocode_funcs import get_google_results, get_api_key, read_results_from_pickle
  key = get_api_key('/home/richie/Dropbox/Code/Python/geocoder/key.txt')
  def test_nonfull_results():
      kilcanway_nonfull = get_google_results("Kilcanway, Mallow, Co. Cork, Ireland",
                                             api_key = key,
                                             return_full_response = False)
      oldnon_full = read_results_from_pickle('nonfull_kilcanway.pkl')
      assert kilcanway_nonfull == oldnon_full

  def test_full_results():
      kilcanway_full = get_google_results("Kilcanway, Mallow, Co. Cork, Ireland",
                                             api_key = key,
                                             return_full_response = True)
      old_full = read_results_from_pickle('full_kilcanway.pkl')
      assert kilcanway_full == old_full    

#+end_src

Some copying and creation of files later, we have some tests. 

We probably also need a test to make sure that we break if there's 
no API key, but again, we'll leave that for now.
