refactoring_gecoding.html
<div id="outline-container-org3f1099e" class="outline-3">
<h3 id="org3f1099e"><span class="section-number-3">0.6</span> More Unit Tests</h3>
<div class="outline-text-3" id="text-0-6">
<p>
At this point, we should add some tests. The <b>get<sub>google</sub><sub>results</sub></b> is the core
of this program, and as such we should make sure that we get good coverage
here. 
</p>

<p>
There's a couple of things that stand out as needing testing:
</p>
<ul class="org-ul">
<li>The type of response</li>
<li>The length of the response: note the doc string</li>
<li>what happens if there is no address</li>
<li>full response vs non-full response:
<ul class="org-ul">
<li>differences in returned fields</li>
<li>differences in names and shape of said fields</li>
</ul></li>
</ul>

<p>
We can skip a bunch of this by just assuming that the results are
correct; and testing that. This is normally called characterisation
testing. Note that this is less useful in small examples like this,
but can be incredibly effective in larger systems. 
</p>

<p>
The basic idea is that you get some data from the system, like
a geocoded address, save it and then run the test by comparing
the original output to the new output. This is hacky, not pretty
and ruthlessly effective (in the short term). Long term, you
want to actually test the designed functionality (i.e. does the system
do what it's supposed to), but when refactoring, an assurance of
no changes is probably just as useful. 
</p>

<p>
In order to do this, we need to write a function that 
saves our results in some format. We'll use <b>pickle</b> for this
purpose, as it's standard and reasonably simple. 
</p>

<p>
The way python handles files bugs me normally <sup><a id="fnr.11" class="footref" href="#fn.11">11</a></sup>, so we'll
write a wrapper around the with statement dance we need. 
</p>

<div class="org-src-container">
<pre class="src src-python">import pickle
def write_results_to_pickle(results, filename):
    with open(filename, 'wb') as f:
        pickle.dump(results, f)

def read_results_from_pickle(filename):
    with open(filename, 'rb') as f:
        res = pickle.load(f)
    return res
</pre>
</div>




<div class="org-src-container">
<pre class="src src-python">from geocode_funcs import get_google_results, get_api_key, read_results_from_pickle
key = get_api_key('/home/richie/Dropbox/Code/Python/geocoder/key.txt')
def test_nonfull_results():
    kilcanway_nonfull = get_google_results("Kilcanway, Mallow, Co. Cork, Ireland",
                                           api_key = key,
                                           return_full_response = False)
    oldnon_full = read_results_from_pickle('nonfull_kilcanway.pkl')
    assert kilcanway_nonfull == oldnon_full

def test_full_results():
    kilcanway_full = get_google_results("Kilcanway, Mallow, Co. Cork, Ireland",
                                           api_key = key,
                                           return_full_response = True)
    old_full = read_results_from_pickle('full_kilcanway.pkl')
    assert kilcanway_full == old_full    

</pre>
</div>

<p>
Some copying and creation of files later, we have some tests. 
</p>

<p>
We probably also need a test to make sure that we break if there's 
no API key, but again, we'll leave that for now.
</p>
</div>
</div>
