refactoring_gecoding.html
<div id="outline-container-org76a0e9e" class="outline-2">
<h2 id="org76a0e9e"><span class="section-number-2">1</span> Conclusions</h2>
<div class="outline-text-2" id="text-1">
<p>
However, I probably want to start changing things at this point.
</p>

<p>
A few obvious extensions which would be relatively easy:
</p>
<ul class="org-ul">
<li>apply approach to different country/dataset</li>
<li>Add caching to script to prevent querying google if we already have
a result (for resales)</li>
<li>Write to a database instead of a flat file.</li>
</ul>

<p>
Consider the possibility of writing to a DB. We can now just bundle
all the logic up into log<sub>progress</sub><sub>and</sub><sub>results</sub> and the rest of the
code doesn't need to care. We'll need to update the tests, and
it would probably be worth adding an option so that we can
still output to a flat file if necessary, but this is much
easier than before.
</p>

<p>
The different country or dataset is a little tricker, because we
haven't abstracted the logic for addresses into a function. 
</p>

<p>
Additionally, it would be good to add a function for the main
loop, but that's lower value for now, as I can easily run
my new geocoder script on new data, which was the purpose 
of my refactoring in the first place. 
</p>

<p>
I j
</p>
</div>
</div>
